src/Reports/ЭффективностьЗатратНаПривлечение/ЭффективностьЗатратНаПривлечение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ЭффективностьЗатратНаПривлечение</name>
  <attributes>
    <name>ДатаРасходовС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРасходовПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриходовС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриходовПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаборИсточников</name>
    <type>
      <types>ValueList</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОтчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Report>

src/AccumulationRegisters/ЗатратыНаИсточникиПерсонала/ЗатратыНаИсточникиПерсонала.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗатратыНаИсточникиПерсонала</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>СуммаЗатрат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ИсточникПерсонала</name>
    <type>
      <types>CatalogRef.ИсточникиИнформации</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/InformationRegisters/Работники/Работники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Работники</name>
  <comment>(Упр)</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>ЗанимаемыхСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </resources>
  <attributes>
    <name>ПричинаИзмененияСостояния</name>
    <type>
      <types>EnumRef.ПричиныИзмененияСостояния</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаУвольнения</name>
    <type>
      <types>CatalogRef.ОснованияУвольнения</types>
    </type>
  </attributes>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ПричиныИзмененияСостояния/ПричиныИзмененияСостояния.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПричиныИзмененияСостояния</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>ПриемНаРаботу</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Увольнение</name>
    <comment>(Общ)</comment>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ЗаявкиКандидатов/ЗаявкиКандидатов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЗаявкиКандидатов</name>
  <comment>(Упр)</comment>
  <attributes>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>CatalogRef.СостоянияЗаявокКандидатов</types>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <type>
      <types>EnumRef.Важность</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрыта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатЗакрытия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаЗаявок</name>
    <type>
      <types>CatalogRef.ГруппыЗаявокКандидатов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОткрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникИнформации</name>
    <type>
      <types>CatalogRef.ИсточникиИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>Вакансия</name>
    <type>
      <types>CatalogRef.Вакансии</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Reports/ЭффективностьЗатратНаПривлечение/ObjectModule.bsl
#Если Клиент Тогда

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Возвращает основную форму отчета, связанную с данным экземпляром отчета
//
// Параметры
//	Нет
//
Функция ПолучитьОсновнуюФорму() Экспорт
	 ПолучитьФорму()
КонецФункции // ПолучитьОсновнуюФорму()

// Настраивает отчет по переданной структуре параметров
//
// Параметры:
//	Нет.
//
Процедура Настроить(Параметры) Экспорт

	

КонецПроцедуры

// Выполняет настройку отчета по умолчанию для заданного вида отчета
//
// Параметры: 
// 
Процедура ЗаполнитьНачальныеНастройки() Экспорт
		
	// Набор источников для отчета
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ИсточникиИнформации.Ссылка,
		|	ИсточникиИнформации.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ИсточникиИнформации КАК ИсточникиИнформации
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование");
	
	Выборка = Запрос.Выполнить().Выбрать();
	НаборИсточников.Очистить();
	Пока  Выборка.Следующий() Цикл
		 НаборИсточников.Добавить(Выборка.Ссылка, Выборка.Наименование);	
	КонецЦикла;
	
	ТипОтчета = "Работник";
	
КонецПроцедуры

// Выполняет запрос и формирует табличный документ-результат отчета
// в соответствии с настройками, заданными значениями реквизитов отчета.
//
// Параметры:
//	ДокументРезультат - табличный документ, формируемый отчетом,
//
//Процедура СформироватьОтчет(ДокументРезультат, ЕстьОшибки = Ложь) Экспорт
Процедура СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок = Ложь, ВысотаЗаголовка = 0, ТолькоЗаголовок = Ложь) Экспорт
	
	ДокументРезультат.Очистить();
	
	// Получить данные.
	Запрос = новый Запрос;
	
	ТекстЗапросаКандидатов =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НаИсточникиПерсонала.Наименование КАК Источник,
	|	ЕСТЬNULL(ЗатратыНаИсточникиПерсоналаОбороты.СуммаЗатратОборот, 0) КАК Затраты,
	|	ЕСТЬNULL(ПриходПерсоналаПоИсточникамОбороты.Количество, 0) КАК Количество,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПриходПерсоналаПоИсточникамОбороты.Количество, 0) > 0
	|			ТОГДА ЕСТЬNULL(ЗатратыНаИсточникиПерсоналаОбороты.СуммаЗатратОборот, 0) / ПриходПерсоналаПоИсточникамОбороты.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтоимостьКонтакта
	|ИЗ
	|	Справочник.ИсточникиИнформации КАК НаИсточникиПерсонала
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗатратыНаИсточникиПерсонала.Обороты(&ДатаРасходовС, &ДатаРасходовПо, , ИсточникПерсонала В (&НаборИсточников)) КАК ЗатратыНаИсточникиПерсоналаОбороты
	|		ПО НаИсточникиПерсонала.Ссылка = ЗатратыНаИсточникиПерсоналаОбороты.ИсточникПерсонала
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЗаявкаКандидата.ИсточникИнформации КАК ИсточникИнформации,
	|			СУММА(1) КАК Количество
	|		ИЗ
	|			Справочник.ЗаявкиКандидатов КАК ЗаявкаКандидата
	|		ГДЕ
	|			ЗаявкаКандидата.ДатаОткрытия МЕЖДУ &ДатаПриходовС И &ДатаПриходовПо
	|			И ЗаявкаКандидата.ИсточникИнформации В(&НаборИсточников)
	|			И (НЕ ЗаявкаКандидата.ПометкаУдаления)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ЗаявкаКандидата.ИсточникИнформации) КАК ПриходПерсоналаПоИсточникамОбороты
	|		ПО НаИсточникиПерсонала.Ссылка = ПриходПерсоналаПоИсточникамОбороты.ИсточникИнформации
	|ГДЕ
	|	НаИсточникиПерсонала.Ссылка В(&НаборИсточников)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Затраты УБЫВ";
	
	ТекстЗапросаРаботников =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НаИсточникиПерсонала.Наименование КАК Источник,
	|	ЕСТЬNULL(ЗатратыНаИсточникиПерсоналаОбороты.СуммаЗатратОборот, 0) КАК Затраты,
	|	ЕСТЬNULL(ПриходРаботниковПоИсточникамОбороты.Количество, 0) КАК Количество,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПриходРаботниковПоИсточникамОбороты.Количество, 0) > 0
	|			ТОГДА ЕСТЬNULL(ЗатратыНаИсточникиПерсоналаОбороты.СуммаЗатратОборот, 0) / ПриходРаботниковПоИсточникамОбороты.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтоимостьКонтакта
	|ИЗ
	|	Справочник.ИсточникиИнформации КАК НаИсточникиПерсонала
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗатратыНаИсточникиПерсонала.Обороты(&ДатаРасходовС, &ДатаРасходовПо, , ИсточникПерсонала В (&НаборИсточников)) КАК ЗатратыНаИсточникиПерсоналаОбороты
	|		ПО ЗатратыНаИсточникиПерсоналаОбороты.ИсточникПерсонала = НаИсточникиПерсонала.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЗаявкаКандидата.ИсточникИнформации КАК ИсточникИнформации,
	|			СУММА(1) КАК Количество
	|		ИЗ
	|			Справочник.ЗаявкиКандидатов КАК ЗаявкаКандидата
	|		ГДЕ
	|			ЗаявкаКандидата.ДатаОткрытия МЕЖДУ &ДатаПриходовС И &ДатаПриходовПо
	|			И ЗаявкаКандидата.ИсточникИнформации В(&НаборИсточников)
	|			И ЗаявкаКандидата.ФизЛицо В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						Работники.ФизЛицо
	|					ИЗ
	|						РегистрСведений.Работники КАК Работники
	|					ГДЕ
	|						Работники.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.ПриемНаРаботу)
	|						И Работники.Период МЕЖДУ &ДатаПриходовС И &ДатаПриходовПо)
	|			И (НЕ ЗаявкаКандидата.ПометкаУдаления)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ЗаявкаКандидата.ИсточникИнформации) КАК ПриходРаботниковПоИсточникамОбороты
	|		ПО НаИсточникиПерсонала.Ссылка = ПриходРаботниковПоИсточникамОбороты.ИсточникИнформации
	|ГДЕ
	|	НаИсточникиПерсонала.Ссылка В(&НаборИсточников)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Затраты УБЫВ";
	
	// Выбор запроса и макета.
	Если ТипОтчета = "Кандидат" Тогда
		Запрос.Текст = ТекстЗапросаКандидатов;
		Макет = ПолучитьМакет("Макет");
	КонецЕсли;
	
	Если ТипОтчета = "Работник" Тогда
		Запрос.Текст = ТекстЗапросаРаботников;
		Макет = ПолучитьМакет("МакетРаботники");
	КонецЕсли;

	Запрос.УстановитьПараметр("ДатаРасходовС",		ДатаРасходовС);
	Запрос.УстановитьПараметр("ДатаРасходовПо",		ДатаРасходовПо);
	Запрос.УстановитьПараметр("ДатаПриходовС",		ДатаПриходовС);
	Запрос.УстановитьПараметр("ДатаПриходовПо",		ДатаПриходовПо);
	Запрос.УстановитьПараметр("НаборИсточников",	НаборИсточников);

	ТаблицаРезультатов = Запрос.Выполнить().Выгрузить();
	
	Валюта = глЗначениеПеременной("ВалютаУправленческогоУчета").Наименование;
	
	// Подсчет итогов.
	ОбщаяСуммаЗатрат = ТаблицаРезультатов.Итог("Затраты");
	ОбщееКоличество  = ТаблицаРезультатов.Итог("Количество");
	СредняяСтоимость = 0;
	
	Если  ОбщееКоличество > 0 тогда
		СредняяСтоимость = ОбщаяСуммаЗатрат / ОбщееКоличество;
	Иначе
		СредняяСтоимость = "Нет данных";
	КонецЕсли;
	
	//  Вывод в справку.
	
	
	// Заголовок
	Область = Макет.ПолучитьОбласть("Заголовок");
	Область.Параметры.ДатаРасходовС  = Формат(ДатаРасходовС,"ДЛФ=DD");
	Область.Параметры.ДатаРасходовПо = Формат(ДатаРасходовПо,"ДЛФ=DD");
	Область.Параметры.ДатаПриходовС  = Формат(ДатаПриходовС,"ДЛФ=DD");
	Область.Параметры.ДатаПриходовПо = Формат(ДатаПриходовПо,"ДЛФ=DD");
	
	ДокументРезультат.Вывести(Область);
	ВысотаЗаголовка = Область.ВысотаТаблицы;

	Если Не ТолькоЗаголовок тогда
		// Итоги
		Область = Макет.ПолучитьОбласть("Итоги");
	 
		Область.Параметры.Затраты				= ОбщаяСуммаЗатрат;
		Область.Параметры.Кандидаты				= ОбщееКоличество;
		Область.Параметры.СтоимостьКандидата	= СредняяСтоимость;
		Область.Параметры.Валюта				= Валюта;

		ДокументРезультат.Вывести(Область);
		
		// Таблица 

		Область = Макет.ПолучитьОбласть("НачалоТаблицы"); 
		ДокументРезультат.Вывести(Область);

		Область = Макет.ПолучитьОбласть("СтрокаТаблицы"); 
		Область.Параметры.Валюта	= Валюта;
		
		Для каждого СтрокаТаблицы из ТаблицаРезультатов Цикл
			Область.Параметры.Заполнить(СтрокаТаблицы);
			ДокументРезультат.Вывести(Область);
		КонецЦикла;

	КонецЕсли;

	ДокументРезультат.Область(1,,ВысотаЗаголовка).Видимость = ПоказыватьЗаголовок;
	
КонецПроцедуры

#КонецЕсли
